{"bos_token": "<s>", "eos_token": "</s>", "sep_token": "</s>", "cls_token": "<s>", "unk_token": "<unk>", "pad_token": "<pad>", "mask_token": {"content": "<mask>", "single_word": false, "lstrip": true, "rstrip": false, "normalized": true, "__type": "AddedToken"}, "model_max_length": 512, "name_or_path": "EIStakovskii/xlm_roberta_base_multilingual_toxicity_classifier_plus", "special_tokens_map_file": null, "tokenizer_class": "XLMRobertaTokenizer"}