name: "cardiffnlp_onnx_model"
max_batch_size: 0
platform: "onnxruntime_onnx"

input [
{
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [-1, -1]
},
{
    name: "attention_mask"
    data_type: TYPE_INT32
    dims: [-1, -1]
}
]

output {
    name: "output"
    data_type: TYPE_FP32
    dims: [-1, 3]
}

instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]
